---
kind: type
id: T:Autodesk.Revit.DB.Analysis.VectorAtPoint
source: html/fcda8b78-e0a7-d99f-6e4e-e53e3e26fc8c.htm
---
# Autodesk.Revit.DB.Analysis.VectorAtPoint

Stores vectors at one domain point.
 Each vector corresponds to a "measurement" for which this vector was calculated.

## Syntax (C#)
```csharp
public class VectorAtPoint : ValueAtPointBase
```